{
  "article": {
    "id": 360039702912,
    "url": "https://mackerelio.zendesk.com/api/v2/help_center/en-us/articles/360039702912.json",
    "html_url": "https://support.mackerel.io/hc/en-us/articles/360039702912-Calculating-the-number-of-hosts",
    "author_id": 390085917472,
    "comments_disabled": true,
    "draft": false,
    "promoted": false,
    "position": 2,
    "vote_sum": 3,
    "vote_count": 15,
    "section_id": 360008016131,
    "created_at": "2020-02-24T09:15:21Z",
    "updated_at": "2025-07-29T06:23:34Z",
    "name": "Calculating the number of hosts",
    "title": "Calculating the number of hosts",
    "source_locale": "ja",
    "locale": "en-us",
    "outdated": false,
    "outdated_locales": [],
    "edited_at": "2025-07-29T06:23:34Z",
    "user_segment_id": null,
    "permission_group_id": 1305651,
    "content_tag_ids": [],
    "label_names": [],
    "body": "<p>The number of hosts will be calculated as follows.</p>\n<ul>\n<li>The number of hosts will be calculated using the average of the past month.\n<ul>\n<li>It is the average number of hosts, not the maximum number of concurrent active hosts or the total number of hosts.</li>\n<li>For example, even if there is a temporary increase in the number of servers due to high-load countermeasures, the usage fee will not increase significantly.</li>\n<li>Any decimal points calculated in the average will be rounded up.\n<ul>\n<li>For example, in the case of 3.2 hosts, the number will be rounded up to 4 and charges will be made accordingly.</li>\n</ul>\n</li>\n<li>For the first month of your contract, you will be billed for usage from the date you sign up for a paid plan until the end of the month.\n<ul>\n<li>Example: If you are using 5 Standard Hosts and signed up for the Standard Plan on the 15th of a month ending on the 31st, the number of Standard Hosts you will be using will be approximately 3 (rounded up).</li>\n<li>The formula: 5 standard hosts * (31 days - 15 days)/31 days = 2.58...</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>The number of active hosts will be counted periodically in time intervals of about 1 hour.\n<ul>\n<li>\n<p>The number of unique hosts that have accessed the metric posting API will be included <a href=\"https://mackerel.io/docs/entry/howto/alerts#host-statuses\">regardless of those hosts’ statuses</a>.</p>\n<ul>\n<li>Hosts with metric posts are counted as active hosts even if the host status is <code>poweroff</code>.</li>\n</ul>\n</li>\n<li>\n<p>Normally this number will equal the number of mackerel-agents being run.  * Hosts with a “retired” status / hosts with no metric posts will not be counted as active hosts.</p>\n</li>\n</ul>\n</li>\n<li>If you are using a paid plan, even if you have 0 active Standard Hosts, you will be charged for features that are subject to billing by Mackerel, such as metric posting and external monitoring. For more details, please refer to the <a href=\"https://support.mackerel.io/hc/en-us/articles/31304727432729-How-usage-fees-are-calculated\">How usage fees are calculated</a>.</li>\n</ul>\n"
  }
}
